[
  {
    "title": "Ahmed bensharif",
    "rating": "5",
    "content": "Very nice online service. Very prompt.\nNew app freezes more",
    "author": "turbopower007"
  },
  {
    "title": "App upgrade??",
    "rating": "1",
    "content": "The new app is more difficult to navigate and in my opinion the old version was better",
    "author": "derkenstien"
  },
  {
    "title": "Ease of use",
    "rating": "5",
    "content": "I like that this app is easy to use I don’t like the new format",
    "author": "4591;;;;;;"
  },
  {
    "title": "Super improved version",
    "rating": "5",
    "content": "Have been using Lloyds Bank app for years but this current version is very intuitive and competes with the best financial apps. out there. It’s very easy to get things done on the app. than going to the website online.\nWell done Lloyds, keep the improvements coming…don’t relax",
    "author": "FrankieBobo1"
  },
  {
    "title": "Easy and convenient",
    "rating": "5",
    "content": "The new features of the banking app looks great and the bank app is easy and convenient to use",
    "author": "Lord Listo"
  },
  {
    "title": "Najeeb",
    "rating": "5",
    "content": "My bank the best bank in uk best service best staff salute to all staff",
    "author": "ahmedfivestar"
  },
  {
    "title": "Great banking app",
    "rating": "5",
    "content": "I give it a 5 star rating",
    "author": "GDF61"
  },
  {
    "title": "Hard to finding",
    "rating": "3",
    "content": "I find it hard to get to what I want now, I used to be able to find things easily like direct debits and standing orders easily but now I have  jump through hoops and find it easy to make mistakes. App was good six months ago but now try not to use it",
    "author": "Gutted one"
  },
  {
    "title": "Payment",
    "rating": "5",
    "content": "Quick and very easy",
    "author": "Sandra Lesley"
  },
  {
    "title": "Exilent work",
    "rating": "5",
    "content": "This bank my favourite bank easy send money ,no wait and more benefit,overdraft,credit cards and cash back etc…",
    "author": "Prem vilasra"
  },
  {
    "title": "At last",
    "rating": "5",
    "content": "Just the job at last I  like this ap what a difference to the way I can keep an eye on my accounts 👍",
    "author": "brianzwurld"
  },
  {
    "title": "M weight",
    "rating": "1",
    "content": "A",
    "author": "MAWeight"
  },
  {
    "title": "Online banking",
    "rating": "4",
    "content": "Hi I was experiencing some difficulties logging into the app contacted the bank many times and the AI was useless as I wanted to contact an agent however the AI thought they knew best. Clearly not. After a week of not being able to log in I finally got through an agent whose name was kacper who was great and understood my situation and helped me through it. However that took an hour of my spare time and thankfully got compensated for the inconvenience for me. But kacper was great he needs to be recognised. I love how the bank handled my situation however the situation should not happen in the first place",
    "author": "Hasan246!"
  },
  {
    "title": "App was great, now bad",
    "rating": "1",
    "content": "What on Earth have Lloyds done to the banking app? It used to be well laid out and clear, now it’s a cluttered mess. Why so many tabs? Why the juvenile graphics? The font use for the digits may have last been seen in something knocked out by Johannes Gutenberg. If only you’d proactively asked us what could have been improved with the old app.",
    "author": "Ironfilings"
  },
  {
    "title": "Service",
    "rating": "5",
    "content": "Top dollar services",
    "author": "CGK 2024"
  },
  {
    "title": "No longer working",
    "rating": "1",
    "content": "Since the most recent upgrade this app no longer works on my ipad and just crashes before opening. Pity as until the upgrade all was good",
    "author": "tapnstrum"
  },
  {
    "title": "Best site ever! I absolutely love it and I love Jo",
    "rating": "5",
    "content": "I really love Lloyds bank they are the bestest",
    "author": "T Dog01"
  },
  {
    "title": "Crappy Lloyds",
    "rating": "1",
    "content": "Very bad",
    "author": "It orr"
  },
  {
    "title": "Fonts",
    "rating": "2",
    "content": "The serif fonts have no place in app.",
    "author": "Slick66design"
  },
  {
    "title": "Thank you",
    "rating": "5",
    "content": "My savour!! Can’t always get into a branch. Ables me to check my balance pay things . Great way to bank !!!",
    "author": "sorry no more !!!"
  },
  {
    "title": "Easy when you know how",
    "rating": "5",
    "content": "I used to find phone banking confusing but the staff are helpful and efficient. Easy when you know how.",
    "author": "Plai old Mike Gleeson"
  },
  {
    "title": "So helpful",
    "rating": "5",
    "content": "I’ve been with Lloyds since I was 14, it’s a great bank to be with.\nThe app is great and so easy to use and the customer support on the phone is really what I appreciate most. In a time where all other support centres offer impersonal advice  overseas  it’s great to know that I can speak to someone who knows my account and who can really help. \nThanks",
    "author": "Lowe. s"
  },
  {
    "title": "Savings",
    "rating": "5",
    "content": "Really easy to access.",
    "author": "Mojoeeeeee"
  },
  {
    "title": "Not good",
    "rating": "1",
    "content": "Don’t like the new app",
    "author": "GKEeeeeer"
  },
  {
    "title": "New Account",
    "rating": "5",
    "content": "So Happy to open this account such an easy transition no complexity just smooth and easy",
    "author": "jamaco2022"
  },
  {
    "title": "Excellent service",
    "rating": "5",
    "content": "I have been with Lloyd’s since I was 17 i am now 62 always been very pleased only criticism is that you have change the on line looks a bit dated  but perhaps I am showing my age also not as straight forward as the old format just a thought",
    "author": "buggatti royal"
  },
  {
    "title": "Bank",
    "rating": "5",
    "content": "Brilliant app",
    "author": "Flange lic"
  },
  {
    "title": "Ease",
    "rating": "5",
    "content": "Payment made with ease",
    "author": "Dicxee"
  },
  {
    "title": "New app",
    "rating": "5",
    "content": "It took a while to get used to the new app, but now I like it a lot. It’s easy and clear to use.To say that at age 78 is something!\nCompared with the app of my other bank, I especially like that it’s easy to access the log off function.",
    "author": "lankyroz"
  },
  {
    "title": "Update App",
    "rating": "5",
    "content": "New Update is fantastic",
    "author": "hasib_"
  },
  {
    "title": "Rev",
    "rating": "4",
    "content": "Takes too long to get into app sometimes",
    "author": "Hdidgxushjhudjd123452Aa"
  },
  {
    "title": "TERRIBLE, AWFUL, HORRIBLE!!",
    "rating": "1",
    "content": "TERRIBLE, AWFUL,HORRIBLE!! The updated app is hideous!!!!",
    "author": "Julia Kermode"
  },
  {
    "title": "Frozen App",
    "rating": "1",
    "content": "Trying to access mobile banking and the app is frozen. \nWhy couldn’t you leave the app as it was before this ridiculous update. Absolutely rubbish.",
    "author": "Can’tgetmoney"
  },
  {
    "title": "Monzo",
    "rating": "5",
    "content": "Great bank! Easy. Stress-free and FAST",
    "author": "ireneotugo"
  },
  {
    "title": "Horrible feel to the new app",
    "rating": "3",
    "content": "Functionally the app is the same as before as far as I can tell, but the look and feel is really quite unpleasant. The font and styling make the app feel really quite dated. Sadly I don’t see this new version as an improvement in any way.",
    "author": "Stewart J"
  },
  {
    "title": "Some things new",
    "rating": "5",
    "content": "This version of mobile app looks great and easy to \nWork with I love it what do you think",
    "author": "Elhami"
  },
  {
    "title": "Good App",
    "rating": "4",
    "content": "I do like the Lloyds app. Very easy to use and stable. Also the fingerprint recognition is welcome. Much faster login I will add that I find it annoying when I want to quickly log in, it brings up things I have to skip before it shows me my accounts which is a pain when I’m in a rush.",
    "author": "mikemorgan88"
  },
  {
    "title": "What took you so long?",
    "rating": "5",
    "content": "I’ve been a Lloyds customer for 41 years. The app is great, works really well and the notifications let me keep track of all activity on my accounts.",
    "author": "Satnav User"
  },
  {
    "title": "Lloyds online banking",
    "rating": "5",
    "content": "My favourite online banking app by far both for personal and business. I use both services multiple times daily and it makes my life so much easier",
    "author": "Yard Mcr"
  },
  {
    "title": "Notifications not working",
    "rating": "2",
    "content": "I have turned on notifications for when money comes into my account but for some reason I never get them…I am running on the latest iOS",
    "author": "mjd223"
  },
  {
    "title": "Redesign ruined app",
    "rating": "1",
    "content": "Why did you take the best uk banking app and ruin it. The journeys don’t make sense, the font, colour \u0026 spacing make it difficult to read, and why on earth between savings if I make a payment do I have to set up again who I’m paying when I have them in my current account.\n\nI’ve been with Lloyds for 20 years, but I can’t use this app. It’s time to switch",
    "author": "Ready2Ragnarok"
  },
  {
    "title": "The new look",
    "rating": "3",
    "content": "Hate the new font !",
    "author": "DebsyLo"
  },
  {
    "title": "New app",
    "rating": "5",
    "content": "Love the new app at Lloyds",
    "author": "Susan from Sheldon"
  },
  {
    "title": "Check your content",
    "rating": "1",
    "content": "Put money in to transfer out into another account. Llyods then suspended my log in details so no about to login. The screen says lines are open 24 hours but it’s not. \n\nI was looking to do a switch but I’m not sure anymore. How can you suspend an me send money to my own bank account that I’ve used before. And not have the right information details.",
    "author": "Sweetcakesandmilkshakea"
  },
  {
    "title": "Lloyds Bank is the best",
    "rating": "5",
    "content": "Excellent work",
    "author": "Miky 1z"
  },
  {
    "title": "It works, but …",
    "rating": "1",
    "content": "The new user interface looks like the school children have designed their first website.  The choice of font for the main titles is hard to read. There is little text hierarchy.  The icons look cheap. It’s don’t feel like a world class bank.",
    "author": "Paul1092778"
  },
  {
    "title": "Awful new app great old app",
    "rating": "2",
    "content": "I am not enjoying the new app as the font you are using are not as clear as previous versions. Also you are using much more of the screen to push your new products rather than letting me do the banking I need to do on a daily/weekly basis",
    "author": "sifran39"
  },
  {
    "title": "Essential this day",
    "rating": "5",
    "content": "With people trying to take what’s not theirs (Your money) It is good to be able to check my account regularly as habit Reassurance is important and being able to check pending payments is good,",
    "author": "Christopher Thomson"
  },
  {
    "title": "Very quick",
    "rating": "5",
    "content": "The staff were very polite my bank got done within 10mins unlike tsb which made me wait 2 HOURS!. Recommend loyds very easy and very quick😁",
    "author": "HAYCHHS"
  },
  {
    "title": "App review",
    "rating": "1",
    "content": "The new app no good ..",
    "author": "xkapaq"
  }
]
